bwjj22397/stc8-learning/demo17_RTC时钟_读写数据_日期时间/main.c
#include "Config.h"
#include "GPIO.h"
#include "UART.h"
#include "NVIC.h"
#include "Switch.h"
#include "Timer.h"
#include "Delay.h"
#include "ADC.h"
#include "STC8H_PWM.h"
#include "I2C.h"

/*************************************************************************************
RTC时钟

1. 通过I2C外设(协议)读取PCF8563芯片数据(16字节)
    - 开启扩展寄存器访问使能 EAXSFR()
    - 引脚模式: 开漏输出模式 Open 1, Drain 0
    - I2C协议(一对多)
    
2. 引脚
    - SCL: P3.2 时钟线   (Serial Clock)
    - SDA: P3.3 数据线   (Serial Data)
    - INT: P3.7 下降沿
    
读取芯片里的年月日, 时分秒(世纪, 周)

*************************************************************************************/

void    GPIO_config(void) {
    GPIO_InitTypeDef    GPIO_InitStructure;
    GPIO_InitStructure.Pin  = GPIO_Pin_0 | GPIO_Pin_1;		//指定要初始化的IO,
    GPIO_InitStructure.Mode = GPIO_PullUp;	    //指定IO的输入或输出方式,GPIO_PullUp,GPIO_HighZ,GPIO_OUT_OD,GPIO_OUT_PP
    GPIO_Inilize(GPIO_P3, &GPIO_InitStructure);//初始化
    
    GPIO_InitStructure.Pin  = GPIO_Pin_2 | GPIO_Pin_3;		//指定要初始化的IO,
    GPIO_InitStructure.Mode = GPIO_OUT_OD;	    //指定IO的输入或输出方式,GPIO_PullUp,GPIO_HighZ,GPIO_OUT_OD,GPIO_OUT_PP
    GPIO_Inilize(GPIO_P3, &GPIO_InitStructure);//初始化
}

void    UART_config(void) {
    // >>> 记得添加 NVIC.c, UART.c, UART_Isr.c <<<
    COMx_InitDefine     COMx_InitStructure;                 //结构定义
    COMx_InitStructure.UART_Mode      = UART_8bit_BRTx; //模式, UART_ShiftRight,UART_8bit_BRTx,UART_9bit,UART_9bit_BRTx
    COMx_InitStructure.UART_BRT_Use   = BRT_Timer1;         //选择波特率发生器, BRT_Timer1, BRT_Timer2 (注意: 串口2固定使用BRT_Timer2)
    COMx_InitStructure.UART_BaudRate  = 115200ul;           //波特率, 一般 110 ~ 115200
    COMx_InitStructure.UART_RxEnable  = ENABLE;             //接收允许,   ENABLE或DISABLE
    COMx_InitStructure.BaudRateDouble = DISABLE;            //波特率加倍, ENABLE或DISABLE
    UART_Configuration(UART1, &COMx_InitStructure);     //初始化串口1 UART1,UART2,UART3,UART4

    NVIC_UART1_Init(ENABLE, Priority_1);    //中断使能, ENABLE/DISABLE; 优先级(低到高) Priority_0,Priority_1,Priority_2,Priority_3
    UART1_SW(UART1_SW_P30_P31);     // 引脚选择, UART1_SW_P30_P31,UART1_SW_P36_P37,UART1_SW_P16_P17,UART1_SW_P43_P44
}


/****************  I2C初始化函数 *****************/
void    I2C_config(void)
{
	I2C_InitTypeDef		I2C_InitStructure;

	I2C_InitStructure.I2C_Mode      = I2C_Mode_Master;	// 主从选择   I2C_Mode_Master, I2C_Mode_Slave
	I2C_InitStructure.I2C_Enable    = ENABLE;			// I2C功能使能,   ENABLE, DISABLE
	I2C_InitStructure.I2C_MS_WDTA   = DISABLE;			// 主机使能自动发送,  ENABLE, DISABLE
	I2C_InitStructure.I2C_Speed     = 13;				// 总线速度=Fosc/2/(Speed*2+4),      0~63
    /*                                           速度 =  24M / 2 / (16 * 2 + 4)
                                                 速度 =  12M / 36  = 333.3Kbit/s
                                                    
                                                 400 = 12K / (Speed * 2 + 4)
                                                 400Kbit/s -> 13
                                                 100Kbit/s -> 58
    */
	I2C_Init(&I2C_InitStructure);
    
	NVIC_I2C_Init(I2C_Mode_Master,DISABLE,Priority_0);	//主从模式, I2C_Mode_Master, I2C_Mode_Slave; 中断使能, ENABLE/DISABLE; 优先级(低到高) Priority_0,Priority_1,Priority_2,Priority_3

    // 引脚选择
	I2C_SW(I2C_P33_P32);					//I2C_P14_P15,I2C_P24_P25,I2C_P33_P32
}

#define NUMBER  7

int main(void) {
    u8 dev_Addr = 0x51 << 1;    // 设备写地址 0xA2
    u8 mem_Addr = 0x02;         // 寄存器地址: 从秒钟寄存器开始读
    u8 seconds,minutes,hours,days,weekdays,months,C;
    u16 years;
    // 读写数据数组
    u8 p[NUMBER] = {0};
    
    
    EAXSFR();

    GPIO_config();
    UART_config();
    I2C_config();

    EA = 1;
    
        /*****************************************
    两个地址:
    dev_addr: 设备地址, 决定了I2C和哪个设备通讯(device address)
        - 设备地址:   0x51 (7bit)
        - 设备读地址：0xA3;  (0x51 << 1) | 1
        - 设备写地址：0xA2;  (0x51 << 1)
    
    mem_addr: 存储地址, 决定了I2C和该设备的哪个寄存器register交互(memory address)
        - 用于指定从哪个寄存器开始读写数据
        - 每次读写数据字节后，寄存器地址自动累加。
    
    u8 *p   : 读写数据缓冲区
    number  : 读写的数据个数
    ******************************************/
    
    p[0] = 0x55;
    p[1] = 0x59;
    p[2] = 0x23;
    p[3] = 0x31;
    p[4] = 0x03;
    p[5] = 0x12;
    p[6] = 0x99;
    
    I2C_WriteNbyte(dev_Addr, 0x02, p, NUMBER);
    
    while (1) {
        I2C_ReadNbyte(dev_Addr, 0x02, p, NUMBER);
        
        seconds  = p[0] & 0x7F;
        minutes  = p[1];
        hours    = p[2];
        days     = p[3];
        weekdays = p[4];
        months   = p[5] & 0x7F;
        years    = p[6];
        
        C = p[5] & 0x80;
        
        if(0 == C){
            years += 0x2000;
        } else {
            years += 0x2100;
        }
        
        // BCD格式数据, 要用16进制打印
//        printf("second: %02X\n", (int)second);        
        // printf("%02X:%02X\n", (int)minute, (int)second);
        // 年-月-日
        printf("%04X-%02X-%02X\n", (int)years, (int)months, (int)days);
        // 时:分:秒
        printf("%02X:%02X:%02X\n", (int)hours, (int)minutes, (int)seconds);
        // week
        printf("week->%d\n", (int)weekdays);
        
        delay_ms(250);
        delay_ms(250);
        delay_ms(250);
        delay_ms(250);
    }
}